---
kind: property
id: P:Autodesk.Revit.DB.Macros.VendorIdAttribute.Value
source: html/5cf36a8f-dc5f-bb00-8819-8c40a75969e3.htm
---
# Autodesk.Revit.DB.Macros.VendorIdAttribute.Value Property

AddInId VendorId value.

## Syntax (C#)
```csharp
public string Value { get; }
```